Repository: DavidRomanovizc/DatingBot
Catalog: locales/*/LC_MESSAGES/dating.po
Languages: de, in

source: На данный момент у нас нет подходящих анкет для вас
de: Wir haben derzeit keine geeigneten Profile für Sie
in: Saat ini kami tidak memiliki profil yang sesuai untuk Anda

source: У вас достигнут лимит на просмотры анкет
de: Sie haben Ihr Limit an Profilansichten erreicht
in: Anda telah mencapai batas melihat profil

source: Кому-то понравилась твоя анкета
de: Ihr Profil hat jemandem gefallen
in: Ada seseorang yang menyukai profil Anda

source: Рад был помочь, {fullname}! Надеюсь, ты нашел кого-то благодаря мне
de: Es war mir eine Freude, {fullname} zu helfen! Ich hoffe, Sie haben jemanden dank mir gefunden
in: Saya senang bisa membantu, {fullname}! Saya harap Anda menemukan seseorang berkat bantuan saya

source: Отлично! Надеюсь вы хорошо проведете время ;) Начинай общаться 👉
de: Toll! Ich hoffe, du hast eine gute Zeit ;) Chatten beginnen 👉
in: Bagus! Saya harap Anda memiliki waktu yang baik ;) Mulailah berbicara 👉

source: {}, {} лет, {} {verification}
de: {}, {} Jahre, {} {verification}
in: {}, {} tahun, {} {verification}

source: <b>Инстаграм</b> - <code>{instagram}</code>
de: <b>instagram</b> - <code>{instagram}</code>
in: <b>Instagram</b> - <code>{instagram}</code>

source: {} <b>Инстаграм</b> - <code>{instagram}</code>
de: {} <b>Instagram</b> - <code>{instagram}</code>
in: {} <b>Instagram</b> - <code>{instagram}</code>

source: На данный момент у нас нет подходящих мероприятий для вас
de: Derzeit haben wir keine passenden Veranstaltungen für Sie
in: Saat ini kami tidak memiliki acara yang cocok untuk Anda hadiri

source: <b>{}</b> Когда: {} Где: {} {}
de: <b>{}</b> Wann: {} Ort: {} {}
in: <b>{}</b> Ketika: {} Di mana: {} {}

source: Несколько {} из города {} хотят познакомиться с тобой прямо сейчас
de: Mehrere {} aus der Stadt {} möchten Sie jetzt treffen
in: Beberapa {} dari {} ingin bertemu dengan Anda sekarang

source: {name}, {age} лет, {city}, {verification} {commentary} <u>Партнерка:</u> Количество приглашенных друзей: {reff} Реферальная ссылка: {link}
de: {name}, {age} Jahre, {city}, {verification} {commentary} <u>Partner:</u>. Anzahl der eingeladenen Freunde: {reff} Empfehlungslink: {link}
in: {name}, {age} tahun, {city}, {verification} {commentary} <u>Afiliasi:</u> Jumlah teman yang diundang: {reff} Tautan referensi: {link}

source: Фильтр по подбору партнеров: 🚻 Необходимы пол партнера: {} 🔞 Возрастной диапазон: {}-{} лет 🏙️ Город партнера: {}
de: Filter nach Partnerauswahl: 🚻 Geschlecht des Partners erforderlich: {} 🔞 Altersbereich: {}-{} Jahre alt 🏙️ Partnerstadt: {}
in: Filter pencarian pasangan: 🚻 Jenis kelamin pasangan yang diinginkan: {} 🔞 Rentang usia: {}-{} tahun 🏙️ Kota pasangan: {}

source: Приветствую вас, {fullname}!! {heart} <b> QueDateBot </b> - платформа для поиска новых знакомств. 🪧 Новости о проекте вы можете прочитать в нашем канале - https://t.me/QueDateGroup <b>🤝 Сотрудничество: </b> Если у вас есть предложение о сотрудничестве, пишите агенту поддержки - @{supports}
de: Grüße, {fullname}!!! {heart} <b> QueDateBot </b> ist eine Plattform zum Finden neuer Partnerschaften. 🪧 Sie können Neuigkeiten über das Projekt in unserem Kanal lesen - https://t.me/QueDateGroup <b>🤝 Zusammenarbeit: </b> Wenn Sie einen Vorschlag für eine Zusammenarbeit haben, schreiben Sie an den Support-Agenten - @{supports}
in: Selamat datang, {fullname}!! {heart} <b> QueDateBot </b> - platform untuk mencari teman baru. 🪧 Anda dapat membaca berita tentang proyek kami di saluran kami - https://t.me/QueDateGroup <b>🤝 Kerjasama: </b> Jika Anda memiliki tawaran kerjasama, silakan hubungi agen dukungan - @{supports}

source: По вашей ссылке зарегистрировался пользователь {}! Вы получаете дополнительных 15 ❤️
de: Ihr Link wurde von einem Benutzer {} verfolgt! Sie erhalten 15 zusätzliche ❤️
in: Pengguna {} telah mendaftar melalui tautan Anda! Anda mendapatkan 15 ❤️ tambahan

source: Регистрация успешно завершена! {}, {} лет, {} <b>О себе</b> - {}
de: Registrierung erfolgreich abgeschlossen! {}, {} Jahre, {} <b>Über mich</b> {}
in: Registrasi berhasil! {}, {} tahun, {} <b>Tentang Saya</b> - {}

source: Фото принято!
de: Foto akzeptiert!
in: Foto diterima!

source: Произошла ошибка! Попробуйте еще раз либо отправьте другую фотографию. Если ошибка осталась, напишите агенту поддержки.
de: Es ist ein Fehler aufgetreten! Bitte versuchen Sie es erneut oder senden Sie ein anderes Foto. Wenn der Fehler weiterhin besteht, schreiben Sie bitte unserem Support-Agenten.
in: Terjadi kesalahan! Silakan coba lagi atau kirim foto lain. Jika masalah masih berlanjut, hubungi agen dukungan.

source: Во время проверки вашего фото мы обнаружили подозрительный контент! Поэтому мы чуть-чуть подкорректировали вашу фотографию
de: Während der Überprüfung Ihres Fotos haben wir verdächtige Inhalte festgestellt! Deshalb haben wir Ihr Foto ein wenig angepasst
in: Selama pemeriksaan foto Anda, kami menemukan konten yang mencurigakan! Kami melakukan sedikit perubahan pada foto Anda

source: Выберите, что вы хотите изменить:
de: Wählen Sie aus, was Sie ändern möchten:
in: Pilih apa yang ingin Anda ubah:

source: Руководство по боту: <b>Страница №{}</b>
de: Bot-Anleitung: <b>Seite Nr. {}</b>
in: Panduan bot: <b>Halaman Nomor {}</b>

source: Вы попали в раздел <b>Информации</b> бота, здесь вы можете посмотреть: статистику,изменить язык, а также посмотреть наш брендбук. 🌐 Дней работаем: <b>{}</b> 👤 Всего пользователей: <b>{}</b>
de: Sie befinden sich im Abschnitt <b>Informationen</b> des Bots. Hier können Sie folgendes anzeigen: Statistiken, Sprache ändern und unseren Markenleitfaden einsehen. 🌐 Tage aktiv: <b>{}</b> 👤 Gesamtanzahl Benutzer: <b>{}</b>
in: Anda telah masuk ke bagian <b>Informasi</b> bot, di sini Anda dapat melihat: statistik, mengubah bahasa, serta melihat brandbook kami. 🌐 Hari bekerja: <b>{}</b> 👤 Jumlah pengguna: <b>{}</b>

source: Я нашел такой адрес: <b>{city}</b> Если все правильно, то подтвердите
de: Ich habe diese Adresse gefunden: <b>{city}</b> Wenn alles korrekt ist, bestätigen Sie

source: Эхо без состояния.
de: Echo ohne Zustand.

source: Меню:
de: Menü:

source: Чтобы начать мониторинг нажмите на кнопку ниже
de: Um die Überwachung zu starten, klicken Sie auf die Schaltfläche unten

source: Анкета пользователя была заблокирована
de: Das Profil des Benutzers wurde blockiert

source: <u><b>📧 Рассылка</b></u> Пришлите текст для рассылки либо фото с текстом для рассылки! Чтобы отредактировать, используйте встроенный редактор телеграма!
de: <u><b>📧 Newsletter</b></u> Senden Sie einen Text zum Versenden oder ein Foto mit Text zum Versenden! Verwenden Sie zum Bearbeiten den eingebauten Telegramm-Editor!

source: Начинаю рассылку!
de: Beginne mit der Massenversand!

source: Сообщение не дошло в чат {chat} Причина: {err}
de: Die Nachricht wurde nicht an den Chat {chat} gesendet. Grund: {err}

source: Рассылка проведена успешно! Ее получили: {count} чатов!
de: Die Massenversand wurde erfolgreich durchgeführt! {count} Chats haben es erhalten!

source: Пришлите мне название кнопки!
de: Bitte senden Sie mir den Namen der Taste!

source: Название кнопки принято! Теперь отправьте мне ссылку для этой кнопки!
de: Der Name der Taste wurde akzeptiert! Bitte senden Sie mir jetzt den Link für diese Taste!

source: Вот так будет выглядеть сообщение: {text}
de: So wird die Nachricht aussehen: {text}

source: Вы подтверждаете отправку?
de: Möchten Sie den Versand bestätigen?

source: Произошла ошибка! Скорее всего, неправильно введена ссылка! Попробуйте еще раз.
de: Es ist ein Fehler aufgetreten! Möglicherweise wurde der Link falsch eingegeben! Versuchen Sie es erneut.

source: Вот сообщение: {text} Вы подтверждаете отправку? Или хотите что-то добавить?
de: Hier ist die Nachricht: {text} Bestätigen Sie die Übermittlung? Oder möchten Sie etwas hinzufügen?

source: Чтобы включить/выключить технические работы, нажмите на кнопку ниже
de: Um Wartungsarbeiten ein- oder auszuschalten, klicken Sie auf die Schaltfläche unten

source: Технические работы включены
de: Wartungsarbeiten sind aktiviert

source: Технические работы выключены
de: Wartungsarbeiten sind deaktiviert

source: Принято!
de: Akzeptiert!

source: Ваше мероприятие прошло модерацию
de: Ihre Veranstaltung wurde moderiert
in: Acara Anda telah melewati moderasi

source: Отклонено!
de: Abgelehnt!
in: Ditolak

source: К сожалению ваше мероприятие не прошло модерацию
de: Leider hat Ihre Veranstaltung die Moderation nicht bestanden
in: Maaf, acara Anda tidak melewati moderasi

source: <b>Привет, я бот, проекта Que Group, для верификации анкет для знакомств</b>
de: <b>Hallo, ich bin ein Bot des Que Group-Projekts zur Überprüfung von Profilen für Dating</b>
in: <b>Halo, saya adalah bot dari proyek Que Group, untuk verifikasi profil untuk kencan</b>

source: Вы забанены!
de: Sie sind gesperrt!
in: Anda diblokir!

source: Вы вернулись в меню фильтров
de: Sie sind zurück im Filtermenü
in: Anda kembali ke menu filter

source: Руководство по боту: <b>Страница №1</b>
de: Bot-Anleitung: <b>Seite Nr. 1</b>
in: Panduan bot: <b>Halaman №1</b>

source: <b>💳 Сейчас вам нужно выбрать способ оплаты</b> ├Стоимость разблокировки - <b>99₽</b> ├Оплата обычно приходить в течение 1-3 минут ├Если у вас нет Yoomoney или нет возможности ├оплатить, напишите агенту поддержки
de: <b>💳 Jetzt müssen Sie eine Zahlungsmethode auswählen</b> ├Entsperrkosten - <b>99₽</b> ├Die Zahlung erfolgt normalerweise innerhalb von 1-3 Minuten ├Wenn Sie kein Yoomoney haben oder nicht in der Lage sind zu bezahlen, ├schreiben Sie dem Support-Agenten
in: <b>💳 Sekarang Anda perlu memilih metode pembayaran</b> ├ Biaya pembukaan blokir - <b>99₽</b> ├ Pembayaran biasanya diterima dalam 1-3 menit ├ Jika Anda tidak memiliki Yoomoney atau tidak dapat ├ melakukan pembayaran, hubungi agen dukungan

source: После оплаты нажмите <b>🔄 Проверить оплату</b>
de: Nach der Zahlung klicken Sie auf <b>🔄 Zahlung bestätigen</b>
in: Setelah pembayaran, tekan <b>🔄 Periksa Pembayaran</b>

source: Поздравляем! Вы были разрабанены
de: Glückwunsch! Du wurdest entfreundet
in: Selamat! Anda telah dibebaskan dari larangan

source: Оплата не прошла! Подождите минут 10, а затем еще раз попробуйте нажать кнопку ниже
de: Zahlung fehlgeschlagen! Warten Sie etwa 10 Minuten und versuchen Sie es dann noch einmal mit der Schaltfläche unten
in: Pembayaran tidak berhasil! Tunggu selama 10 menit, lalu coba lagi dengan menekan tombol di bawah ini

source: <u>Ваши данные: </u>
de: <u>Ihre Angaben: </u>.
in: <u>Data Anda: </u>

source: Введите новое имя
de: Geben Sie einen neuen Namen ein
in: Masukkan nama baru Anda

source: Произошла неизвестная ошибка. Попробуйте ещё раз Возможно, Ваше сообщение слишком большое
de: Es ist ein unbekannter Fehler aufgetreten. Bitte versuchen Sie es erneut Ihre Nachricht ist möglicherweise zu groß
in: Terjadi kesalahan yang tidak diketahui. Silakan coba lagi Mungkin pesan Anda terlalu besar

source: Введите новый возраст
de: Neues Alter eingeben
in: Masukkan usia baru Anda

source: Вы ввели недопустимое число, попробуйте еще раз
de: Sie haben eine ungültige Zahl eingegeben. Bitte versuchen Sie es erneut
in: Anda memasukkan angka yang tidak valid, coba lagi

source: Вы ввели не число, попробуйте еще раз
de: Sie haben eine ungültige Zahl eingegeben. Bitte versuchen Sie es erneut
in: Anda tidak memasukkan angka, coba lagi

source: Введите новый город
de: Geben Sie eine neue Stadt ein
in: Masukkan kota baru Anda

source: Мы не смогли найти город {city}. Попробуйте ещё раз
de: Wir konnten die Stadt {city} nicht finden. Erneut versuchen
in: Kami tidak dapat menemukan kota {city}. Silakan coba lagi

source: Данные успешно изменены. Выберите, что вы хотите изменить:
de: Daten erfolgreich geändert. Wählen Sie aus, was Sie ändern möchten:
in: Data berhasil diubah. Pilih apa yang ingin Anda ubah:

source: 👱🏻‍♂️ Мужской
de: 👱🏻‍♂️ Männlich
in: 👱🏻‍♂️ Pria

source: 👱🏻‍♀️ Женский
de: 👱🏻‍♀️ Weiblich
in: 👱🏻‍♀️ Wanita

source: Выберите новый пол:
de: Wählen Sie ein neues Geschlecht:
in: Pilih jenis kelamin baru Anda:

source: Отправьте мне новую фотографию
de: Schicken Sie mir ein neues Foto
in: Kirimkan saya foto baru Anda

source: Произошла ошибка, проверьте настройки конфиденциальности
de: Es ist ein Fehler aufgetreten. Überprüfen Sie Ihre Datenschutzeinstellungen
in: Terjadi kesalahan, periksa pengaturan privasi Anda

source: Произошла ошибка! Попробуйте еще раз изменить описание. Возможно, Ваше сообщение слишком большое Если ошибка осталась, напишите в поддержку.
de: Es ist ein Fehler aufgetreten! Versuchen Sie, die Beschreibung erneut zu ändern. Ihre Nachricht ist möglicherweise zu groß. Wenn der Fehler weiterhin besteht, wenden Sie sich bitte an den Support.
in: Terjadi kesalahan! Coba lagi ubah deskripsi. Mungkin pesan Anda terlalu besar Jika masalah masih berlanjut, hubungi dukungan.

source: Напишите имя своего аккаунта Примеры: <code>@unknown</code> <code>https://www.instagram.com/unknown</code>
de: Schreiben Sie Ihren Kontonamen Beispiele: <code>@unknown</code> <code>https://www.instagram.com/unknown</code>
in: Tuliskan nama akun Anda Contoh: <code>@unknown</code> <code>https://www.instagram.com/unknown</code>

source: Ваш аккаунт успешно добавлен
de: Ihr Konto wurde erfolgreich hinzugefügt
in: Akun Anda berhasil ditambahkan

source: Вы были возвращены в меню
de: Sie wurden zum Menü zurückgeführt
in: Anda telah kembali ke menu

source: Вы ввели неправильную ссылку или имя аккаунта. Примеры: <code>@unknown</code> <code>https://www.instagram.com/unknown</code>
de: Sie haben einen falschen Link oder einen falschen Benutzernamen eingegeben. Beispiele: <code>@unknown</code> <code>https://www.instagram.com/unknown</code>
in: Anda memasukkan tautan atau nama akun yang salah. Contoh: <code>@unknown</code> <code>https://www.instagram.com/unknown</code>

source: Возникла ошибка. Попробуйте еще раз
de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut
in: Terjadi kesalahan. Silakan coba lagi

source: Вы перешли в меню изменения данных мероприятия
de: Sie haben das Menü zur Änderung der Veranstaltungsdaten aufgerufen
in: Anda telah pindah ke menu pengubahan data acara

source: Напишите новое название вашего мероприятия
de: Geben Sie den neuen Namen Ihrer Veranstaltung ein
in: Tulis nama baru untuk acara Anda

source: Данные изменены
de: Daten wurden geändert
in: Data diubah

source: Напишите новое описание вашего мероприятия
de: Geben Sie eine neue Beschreibung für Ihre Veranstaltung ein
in: Tulis deskripsi baru untuk acara Anda

source: Вы перешли в меню афиш
de: Sie haben das Menü für Plakate aufgerufen
in: Anda telah pindah ke menu acara

source: Введите название мероприятие
de: Geben Sie den Namen der Veranstaltung ein
in: Masukkan nama acara

source: Вы уже создали мероприятие, которое проходит модерацию. Дождитесь проверки, пожалуйста
de: Sie haben bereits eine Veranstaltung erstellt, die gerade moderiert wird. Bitte warten Sie auf die Überprüfung
in: Anda telah membuat acara yang sedang dalam moderasi. Mohon tunggu hingga diverifikasi

source: Прочитайте сообщение и не нажимайте на кнопку, пока ваше мероприятие не пройдет модерацию
de: Lesen Sie die Nachricht und drücken Sie nicht auf die Schaltfläche, bis Ihre Veranstaltung moderiert wurde
in: Baca pesan dan jangan tekan tombol sampai acara Anda lulus moderasi

source: Пожалуйста, выберите дату:
de: 🕕 ein Datum festlegen:
in: Silakan pilih tanggal:

source: Длинна вашего сообщение превышает допустимую. Попробуйте ещё раз
de: Die Länge Ihrer Nachricht überschreitet die zulässige Länge. Erneut versuchen
in: Panjang pesan Anda melebihi batas yang diizinkan. Silakan coba lagi

source: Вы не можете проводить мероприятие в прошлом
de: Sie können keine Veranstaltung in der Vergangenheit abhalten
in: Anda tidak dapat mengadakan acara di masa lalu

source: Теперь напишите место проведения
de: Geben Sie jetzt den Veranstaltungsort ein
in: Sekarang tuliskan tempat acara

source: Вы ввели слишком длинное название городаПопробуйте ещё раз.
de: Sie haben einen zu langen Städtenamen eingegebenVersuchen Sie es erneut.
in: Anda telah memasukkan nama kota yang terlalu panjang. Coba lagi.

source: Произошла неизвестная ошибка! Попробуйте еще раз. Вероятнее всего вы ввели город неправильно
de: Ein unbekannter Fehler ist aufgetreten! Versuchen Sie es erneut. Sie haben wahrscheinlich die Stadt falsch eingegeben
in: Terjadi kesalahan yang tidak diketahui! Coba lagi. Kemungkinan besar Anda telah memasukkan nama kota dengan salah

source: Хорошо, теперь напишите короткое или длинное описание вашего мероприятия
de: Ok, schreiben Sie jetzt eine kurze oder lange Beschreibung Ihrer Veranstaltung
in: Baiklah, sekarang tuliskan deskripsi pendek atau panjang tentang acara Anda

source: И напоследок, пришлите постер вашего мероприятия
de: Und zuletzt senden Sie das Plakat Ihrer Veranstaltung
in: Dan terakhir, kirimkan poster acara Anda

source: Ваше сообщение слишком длинное.Попробуйте написать короче
de: Ihre Nachricht ist zu lang, versuchen Sie, sie kürzer zu schreiben
in: Pesan Anda terlalu panjang. Coba tulis lebih singkat

source: Фото принято
de: Foto angenommen
in: Foto diterima

source: Ваше мероприятие отправлено на модерацию
de: Ihre Veranstaltung wurde zur Moderation gesendet
in: Acara Anda dikirimkan untuk moderasi

source: На данный момент вы никуда не записались
de: Sie sind derzeit nirgendwo eingeschrieben
in: Saat ini Anda belum mendaftar ke mana-mana

source: Вы перешли в раздел с фильтрами
de: Sie haben den Abschnitt mit Filtern aufgerufen
in: Anda telah beralih ke bagian filter

source: Напишите минимальный возраст
de: Geben Sie das Mindestalter ein
in: Tulis usia minimum

source: Теперь введите максимальный возраст
de: Geben Sie nun das Höchstalter ein
in: Sekarang masukkan usia maksimum

source: 👱🏻‍♂️ Парня
de: 👱🏻‍♂️ Kerl
in: 👱🏻‍♂️ Laki-laki

source: 👱🏻‍♀️ Девушку
de: 👱🏻‍♀️ Ein Mädchen
in: 👱🏻‍♀️ Perempuan

source: Выберите, кого вы хотите найти:
de: Wählen Sie, wen Sie suchen möchten:
in: Pilih siapa yang ingin Anda temui:

source: Данные сохранены
de: Daten wurden gespeichert
in: Data disimpan

source: Напишите город вашего будущего партнера
de: Schreiben Sie die Stadt Ihres zukünftigen Partners
in: Tuliskan kota calon pasangan Anda

source: Произошла ошибка, попробуйте еще раз
de: Es ist ein Fehler aufgetreten, bitte versuchen Sie es erneut
in: Terjadi kesalahan, coba lagi

source: Вы перешли в меню настроек фильтров для мероприятий
de: Sie haben das Menü für die Filtereinstellungen für Veranstaltungen geöffnet
in: Anda telah beralih ke menu pengaturan filter untuk acara

source: Напишите город, в котором бы хотели сходить куда-нибудь
de: Schreiben Sie die Stadt, in der Sie gerne etwas unternehmen möchten
in: Tuliskan kota tempat Anda ingin pergi

source: Пройдите опрос, чтобы зарегистрироваться
de: Beantworten Sie die Fragen, um sich zu registrieren
in: Lakukan survei untuk mendaftar

source: Вы уже зарегистрированы, если вам нужно изменить анкету, то нажмите на кнопку ниже
de: Sie sind bereits registriert. Wenn Sie Ihr Profil ändern möchten, klicken Sie auf die folgende Schaltfläche

source: Выберите пол
de: Wählen Sie Ihr Geschlecht
in: Pilih jenis kelamin

source: Теперь расскажите о себе:
de: Jetzt erzählen Sie mir etwas über sich selbst:
in: Sekarang ceritakan tentang diri Anda:

source: Комментарий принят! Выберите, кого вы хотите найти:
de: Kommentar angenommen! Wählen Sie, wen Sie suchen möchten:
in: Komentar diterima! Pilih siapa yang ingin Anda temui:

source: Произошла неизвестная ошибка! Попробуйте изменить комментарий позже в разделе "Меню" Выберите, кого вы хотите найти:
de: Es ist ein unbekannter Fehler aufgetreten! Versuchen Sie, Ihren Kommentar später im Abschnitt Menü zu ändern Wählen Sie aus, wen Sie suchen möchten:
in: Terjadi kesalahan yang tidak diketahui! Coba ubah komentar Anda nanti di bagian "Menu" Pilih siapa yang ingin Anda temukan:

source: Отлично! Теперь напишите мне ваше имя, которое будут все видеть в анкете
de: Super! Schreiben Sie mir jetzt Ihren Namen, den alle in Ihrem Profil sehen werden
in: Baiklah! Sekarang tuliskan nama Anda yang akan dilihat semua orang di profil

source: Введите сколько вам лет:
de: Geben Sie an, wie alt Sie sind:
in: Tuliskan berapa usia Anda:

source: Вы ввели не число
de: Sie haben keine Zahl eingegeben
in: Anda telah memasukkan bukan angka

source: Нажмите на кнопку ниже, чтобы определить ваш местоположение!
de: Klicken Sie auf die Schaltfläche unten, um Ihren Standort zu finden!
in: Klik tombol di bawah ini untuk menentukan lokasi Anda!

source: Мы не смогли найти такой город, попробуйте еще раз
de: Wir konnten eine solche Stadt nicht finden, versuchen Sie es erneut

source: И напоследок, Пришлите мне вашу фотографию (отправлять надо сжатое изображение, а не как документ)
de: Und schließlich: Schicken Sie mir ein Foto von sich (als komprimiertes Bild, nicht als Dokument)
in: Terakhir, Kirimkan foto Anda (kirim gambar yang dikompresi, bukan dokumen)

source: Наш проект работает на <b>Open Source</b> и мы будем рады,если вы нам поможете развивать проект. С помощью кнопки <b>💰 Донат</b> вы можете отправить своё пожертвование
de: Unser Projekt basiert auf <b>Open Source</b> und wir wären dankbar, wenn Sie uns helfen, das Projekt weiterzuentwickeln. Mit der Schaltfläche <b>💰 Spenden</b> können Sie Ihre Spende senden

source: Вам необходимо зарегистрировать агента(ов) тех поддержки
de: Sie müssen Ihre(n) Support-Agent(en) registrieren
in: Anda perlu mendaftarkan agen pendukung

source: Вас нет в базе данной
de: Sie sind nicht in der Datenbank
in: Anda tidak ada dalam database ini

source: Выберите язык
de: Wählen Sie eine Sprache aus
in: Pilih bahasa

source: Язык был успешно изменен. Введите команду /start
de: Die Sprache wurde erfolgreich geändert. Geben Sie den Befehl /start ein
in: Bahasa berhasil diubah. Masukkan perintah /start

source: Произошла какая-то ошибка. Введите команду /start и попробуйте еще раз
de: Es ist eine Art Fehler aufgetreten. Geben Sie den Befehl /start ein und versuchen Sie es erneut
in: Terjadi kesalahan. Masukkan perintah /start dan coba lagi

source: Хотите связаться с тех поддержкой? Нажмите на кнопку ниже!
de: Möchten Sie den technischen Support kontaktieren? Klicken Sie auf die Schaltfläche unten!
in: Ingin menghubungi dukungan? Klik tombol di bawah ini!

source: К сожалению, сейчас нет свободных операторов. Попробуйте позже.
de: Leider sind im Moment keine freien Operator verfügbar. Bitte versuchen Sie es später erneut.
in: Sayangnya, saat ini tidak ada operator yang tersedia. Coba lagi nanti.

source: Вы обратились в техническую поддержку. Ждем ответа от оператора!
de: Sie haben sich an den technischen Support gewendet. Wir warten auf eine Antwort vom Operator!
in: Anda telah menghubungi dukungan teknis. Kami menunggu jawaban dari operator!

source: С вами хочет связаться пользователь {full_name}
de: Der Benutzer {full_name} möchte mit Ihnen Kontakt aufnehmen
in: Anda menerima pesan dari pengguna {full_name}

source: К сожалению, пользователь уже передумал.
de: Leider hat der Benutzer seine Meinung geändert.
in: Sayangnya, pengguna sudah berubah pikiran.

source: Вы на связи с пользователем! Чтобы завершить общение нажмите на кнопку.
de: Sie sind mit dem Benutzer verbunden! Klicken Sie auf die Schaltfläche, um das Gespräch zu beenden.
in: Anda terhubung dengan pengguna! Untuk mengakhiri sesi, klik tombol.

source: Техподдержка на связи! Можете писать сюда свое сообщение. Чтобы завершить общение нажмите на кнопку.
de: Der technische Support ist online! Sie können hier Ihre Nachricht schreiben. Klicken Sie auf die Schaltfläche, um das Gespräch zu beenden.
in: Dukungan teknis sedang online! Anda dapat mengirim pesan di sini. Untuk mengakhiri sesi, klik tombol.

source: Дождитесь ответа оператора или отмените сеанс
de: Warten Sie auf die Antwort des Operators oder brechen Sie die Sitzung ab
in: Tunggu jawaban operator atau batalkan sesi
