Repository: DavidRomanovizc/DatingBot
Catalog: locales/*/LC_MESSAGES/dating.po
Languages: de, in

source: Пользователь завершил сеанс техподдержки
de: Der Benutzer hat die technische Support-Sitzung beendet
in: Pengguna telah mengakhiri sesi dukungan

source: Вы завершили сеанс и были возвращены в главное меню
de: Sie haben die Sitzung beendet und sind zum Hauptmenü zurückgekehrt
in: Anda telah mengakhiri sesi dan kembali ke menu utama

source: Ваша анкета удалена! Я надеюсь вы кого-нибудь нашли
de: Ihr Profil wurde gelöscht! Ich hoffe, Sie haben jemanden gefunden
in: Profil Anda dihapus! Kami harap Anda menemukan seseorang

source: Чтобы пройти верификацию вам нужно отправить свой контакт
de: Um sich zu verifizieren, müssen Sie Ihre Kontaktdaten senden
in: Untuk melakukan verifikasi, Anda perlu mengirimkan kontak Anda

source: Спасибо, {contact_full_name}. Ваш номер {contact_phone_number} был получен.
de: Danke, {contact_full_name}. Ihre Telefonnummer {contact_phone_number} wurde empfangen.
in: Terima kasih, {contact_full_name}. Nomor Anda {contact_phone_number} telah diterima.

source: Ваш номер недействителен, попробуйте еще раз.
de: Ihre Telefonnummer ist ungültig. Bitte versuchen Sie es erneut.
in: Nomor Anda tidak valid, coba lagi.

source: На данный момент вы просмотрели все существующие анкеты
de: Sie haben derzeit alle vorhandenen Profile angesehen
in: Saat ini Anda telah melihat semua profil yang tersedia

source: Слишком много ❤️ за сегодня. Пригласи друзей и получи больше ❤️ https://t.me/{}?start={}
de: Zu viele ❤️ für heute. Laden Sie Ihre Freunde ein und erhalten Sie mehr ❤️ https://t.me/{}?start={}
in: Terlalu banyak ❤️ hari ini. Undang teman dan dapatkan lebih banyak ❤️ https://t.me/{}?start={}

source: 🔍 Найти пользователя
de: 🔍 Benutzer finden

source: 🟢 Разблокировать
de: 🟢 Freischalten

source: 🚫 Заблокировать
de: 🚫 Freischalten

source: 📧 Рассылка
de: 📧 Verteiler

source: Подтвердить отправку
de: Senden bestätigen
in: Konfirmasi Kirim

source: Добавить кнопку
de: Schaltfläche hinzufügen
in: Tambahkan Tombol

source: Отмена
de: Abbrechen
in: Batal

source: ⚙️ Настройки
de: ⚙️ Einstellungen

source: 📝 Статистика
de: 📝 Statistik

source: 📈 Статистика
de: 📝 Statistik

source: *️⃣ Добавить
de: *️⃣ Hinzufügen

source: ❌ Удалить
de: ❌ Löschen

source: ◀️ Назад
de: ◀️ Zurück

source: 🙅🏻‍♂️ Отменить
de: 🙅🏻‍♂️ Abbrechen

source: 👮‍♂️ Админ Состав
de: 👮‍♂️ Admin-Team

source: 📞 Сменить контакты
de: 📞 Kontakte ändern

source: 🗒 Выгрузить юзеров | .txt
de: 🗒 Benutzer exportieren | .txt

source: 🗒 Выгрузить конфиги и логи
de: 🗒 Konfigurationen und Logs exportieren

source: Рассылка
de: Verteiler

source: Сообщение по id
de: Nachricht nach ID

source: Посчитать людей и чаты
de: Zähle Personen und Chats

source: Мониторинг
de: Überwachung

source: Тех.Работа
de: Technische Arbeit

source: 📱 Отправить
de: 📱 Senden
in: 📱 Kirim

source: 🗺 Определить автоматически
de: 🗺 Automatisch ermitteln
in: 🗺 Tentukan Otomatis

source: Взять из профиля
de: Aus dem Profil übernehmen
in: Ambil dari Profil

source: Включить
de: Einschalten
in: Hidupkan

source: Выключить
de: Ausschalten
in: Matikan

source: Разблокировать
de: Freischalten
in: Buka Blokir

source: ⏪️ Вернуться в меню
de: ⏪️ Zurück zum Menü
in: ⏪️ Kembali ke Menu

source: ❌ Остановить
de: ❌ Beenden

source: 👤 Имя
de: 👤 Name
in: 👤 Nama

source: ⚧ Пол
de: ⚧ Geschlecht
in: ⚧ Jenis Kelamin

source: 📅 Возраст
de: 📅 Alter
in: 📅 Usia

source: 🏙 Город
de: 🏙 Stadt
in: 🏙 Kota

source: 📷 Фото
de: 📷 Foto
in: 📷 Foto

source: 📝 О себе
de: 📝 Über mich
in: 📝 Tentang Saya

source: 🎉 Мероприятия
de: 🎉 Veranstaltungen
in: 🎉 Acara

source: ❤️ Знакомства
de: ❤️ Dating
in: ❤️ Kenalan

source: ⏪️ Назад
de: ⏪️ Zurück
in: ⏪️ Kembali

source: 🏙️ Город партнера
de: 🏙️ Stadt deines Partners
in: 🏙️ Kota Pasangan

source: 🔞 Возр.диапазон
de: 🔞 Altersgruppe
in: 🔞 Rentang Usia

source: 🚻 Пол партнера
de: Geschlecht des partners
in: 🚻 Jenis Kelamin Pasangan

source: 🏙️ Город
de: 🏙️ Stadt
in: 🏙️ Kota

source: Вперед ➡️
de: Los ➡️
in: Maju ➡️

source: ❌ Закрыть
de: ❌ Schließen
in: ❌ Tutup

source: 🇷🇺 Русский
de: 🇷🇺 Russisch
in: 🇷🇺 Russia

source: 🇩🇪 Немецкий
de: 🇩🇪 Deutsch
in: 🇩🇪 Jerman

source: 🇬🇧 Английский
de: 🇬🇧 Englisch
in: 🇬🇧 Inggris

source: 🇮🇩 Индонезийский
de: 🇮🇩 Südseesprachen
in: 🇮🇩 Indonesia

source: ➕ Регистрация
de: ➕ Registrierung
in: ➕ Registrasi

source: 🌐 Язык
de: 🌐 Sprache
in: 🌐 Bahasa

source: 👤 Моя анекта
de: 👤 Mein Profil
in: 👤 Profil Saya

source: ⚙️ Фильтры
de: ⚙️ Filter
in: ⚙️ Filter

source: 💌 Найти пару
de: 💌 finden ein Paar
in: 💌 Temukan Pasangan

source: 🗓️ Афиша
de: 🗓️ Poster
in: 🗓️ Acara

source: 🆘 Поддержка
de: 🆘 Support
in: 🆘 Bantuan

source: ℹ️ Информация
de: ℹ️ Informationen
in: ℹ️ Informasi

source: ✅ Верификация
de: ✅ Richtigkeitsprüfung
in: ✅ Verifikasi

source: 🖊️ Изменить
de: 🖊️ Ändern
in: 🖊️ Ubah

source: 🗑️ Удалить
de: 🗑️ Löschen
in: 🗑️ Hapus

source: ⏪ Назад
de: ⏪ Zurück
in: ⏪ Kembali

source: 💳 ЮMoney
de: 💳 YouMoney
in: 💳 Yandex.Money

source: 💳 Оплатить
de: 💳 Bezahlen
in: 💳 Bayar

source: 🔄 Проверить оплату
de: 🔄 Scheckzahlung
in: 🔄 Periksa Pembayaran

source: ✍️Создать афишу
de: Plakat erstellen
in: ✍️ Buat Acara

source: 🎭 Смотреть афиши
de: 🎭 Poster beobachten
in: 🎭 Lihat Acara

source: 📝 Мои записи
de: 📝 Meine Aufzeichnungen
in: 📝 Catatan Saya

source: 📃 Моё событие
de: 📃 Mein Ereignis
in: 📃 Acara Saya

source: ✍️ Изменить
de: ✍️ Ändern
in: ✍️ Ubah

source: Название
de: Titel
in: Nama

source: Описание
de: Beschreibung
in: Deskripsi

source: ✅ Одобрить
de: ✅ Genehmigen
in: ✅ Setujui

source: ❌ Отклонить
de: Ablehnen
in: ❌ Tolak

source: Пойду!
de: Ich gehe hin!
in: Akan Saya Hadiri!

source: Не интересно
de: Nicht interessiert
in: Tidak Tertarik

source: ⏪️ Остановить
de: ⏪️ Stoppen
in: ⏪ Berhenti

source: ❌ Отменить запись
de: ❌ Eintrag abbrechen
in: ❌ Batalkan Pendaftaran

source: 🚫 Забанить
de: 🚫 Blockieren
in: 🚫 Blokir

source: Следующий
de: Nächste Person
in: Selanjutnya

source: 🚀 Смотреть
de: 🚀 Ansehen
in: 🚀 Lihat

source: 👉 Перейти в чат
de: 👉 Zum Chat gehen
in: 👉 Buka Obrolan

source: ⏪️ Вернуться к просмотру анкет
de: ⏪️ Zurück zur Profilansicht
in: ⏪️ Kembali ke tampilan profil

source: 🖌️ Пройти опрос в боте
de: 🖌️ Durchgehen Umfrage im Bot
in: 🖌️ Isi kuesioner di bot

source: ✅ Да все хорошо!
de: ✅ Ja, alles ist gut!
in: ✅ Ya, semuanya baik!

source: 📚 Брендбук
de: 📚 Markenbuch
in: 📚 Brandbook

source: 📞 Контакты
de: 📞 Kontakte
in: 📞 Kontak

source: Ответить пользователю
de: Dem Benutzer antworten
in: Balas Pengguna

source: Написать оператору
de: Schreiben Sie an den Betreiber
in: Tulis ke Operator

source: Завершить сеанс
de: Sitzung beenden
in: Akhiri Sesi

source: 😢 Вы заблокированы!
de: 😢 Sie sind blockiert!
in: 😢 Anda telah diblokir!

source: Ведутся технические работы
de: Technische Arbeiten sind im Gange
in: Sedang dalam perawatan teknis

source: Вы подписались не на все каналы! Чтобы продолжить пользоваться ботом, подпишитесь! Ссылки ниже:
de: Sie haben nicht alle Kanäle abonniert! Um den Bot weiterhin zu nutzen, abonnieren Sie bitte! Links unten:
in: Anda belum berlangganan di semua saluran! Untuk melanjutkan menggunakan bot, berlanggananlah! Tautan di bawah ini:

source: <b>📊 Статистика: </b> └Сейчас в нашем боте <b>{count_users} пользователей</b> └Из них: ├<b>{users_gender_m} пользователей мужского пола</b> ├<b>{users_gender_f} пользователей женского пола</b> ├<b>{users_city} пользователей из города {user_city}</b> ├<b>{cs_uy} пользователей из других городов</b> ├<b>{users_verified} верифицированных пользователей</b> ├<b>{users_status} пользователей, создавшие анкету</b> └Дата создания бота - <b>10.08.2021</b>
de: <b>📊 Statistik: </b> └Derzeit sind <b>{count_users} Benutzer</b> in unserem Bot registriert. └Davon: ├<b>{users_gender_m} männliche Benutzer</b> ├<b>{users_gender_f} weibliche Benutzer</b> ├<b>{users_city} Benutzer aus der Stadt {user_city}</b> ├<b>{cs_uy} Benutzer aus anderen Städten</b> ├<b>{users_verified} verifizierte Benutzer</b> ├<b>{users_status} Benutzer, die ein Profil erstellt haben</b> └Bot-Erstellungsdatum - <b>10.08.2021</b>
in: <b>📊 Statistik: </b> └Saat ini bot kami memiliki <b>{count_users} pengguna</b> └Diantara mereka: ├<b>{users_gender_m} pengguna berjenis kelamin pria</b> ├<b>{users_gender_f} pengguna berjenis kelamin wanita</b> ├<b>{users_city} pengguna berasal dari kota {user_city}</b> ├<b>{cs_uy} pengguna berasal dari kota lain</b> ├<b>{users_verified} pengguna terverifikasi</b> ├<b>{users_status} pengguna telah membuat profil</b> └Bot dibuat pada tanggal <b>10 Agustus 2021</b>
