words = ['ДАУНЫ', 'ДОЛБАЕБЫ', 'УБЛЮДКИ', 'ЕБАНЫЕ', 'хуй', 'пизд', 'пидар', 'Пидор', 'пидор', 'сука',
         'Уебан', 'уебан', 'целка', 'чмошник', 'чмырь',
         'шалава', 'суки', 'Суки', 'Целка', 'Чмо', 'Чмошник', 'Чмырь', 'Шалава', 'очкун', 'падла',
         'падонки', 'падонок', 'паскуда', 'педера', 'педик', 'педрик', 'педрила', 'педрилло',
         'педрило', 'педрилы', 'Очкун', 'Падла', 'Падонки', 'Падонок', 'Паскуда', 'Педера', 'Педик',
         'Педрик', 'Педрила', 'Педрилло', 'Педрило', 'Педрилы', 'говенка', 'говенный', 'говешка',
         'говнище', 'говноед', 'говнолинк', 'говнюк', 'говнюха', 'говнядина', 'говняк', 'говняный',
         'говнять', 'Сволота', 'Сволочь', 'Суходрочка', 'Сучара', 'Сучий', 'Сучка',
         'Сучонок', 'Сучье', 'Сцука', 'Сцуки', 'Сцук', 'сцуки', 'Сцуконах', 'Шлюха',
         'Шлюхо', 'Шлюшка', 'Ушлепок', 'Придурок', 'шалавой', '6ля', '6лядь',
         'b3ъeб', 'cock', 'cunt', 'e6aль', 'ebal', 'eblan', 'eбaл', 'eбaть',
         'eбyч', 'eбать', 'eбёт', 'eблантий', 'fuck', 'fucker', 'fucking', 'xyёв',
         'xyй', 'xyя', 'xуе', 'xуй', 'xую', 'zaeb', 'zaebal', 'zaebali', 'zaebat',
         'архипиздрит', 'ахуел', 'ахуеть', 'бздение', 'бздеть', 'бздех', 'бздецы', 'бздицы', 'бздло',
         'бзднуть', 'бздун', 'бздунья', 'бздюха', 'бздюшка', 'бздюшко',
         'вафел', 'вафлёр', 'взъебка', 'блядь',
         'взьебка', 'взьебывать', 'въеб', 'въебался', 'въебенн', 'въебусь', 'въебывать',
         'выеб', 'выебать', 'выебен', 'выебнулся', 'выебон', 'выебываться', 'выпердеть', 'высраться',
         'выссаться', 'вьебен', 'гавнюк', 'гавнючка', 'гандон', 'гнид',
         'гнида', 'гниды', 'гондон', 'доебываться', 'долбоеб', 'долбоёб', 'долбоящер', 'дрисня',
         'дристануть', 'дристать', 'дристун', 'дристуха', 'дрочелло', 'дрочена', 'дрочила', 'дрочилка', 'дрочистый',
         'дрочить', 'дрочка', 'дрочун', 'е6ал', 'е6ут', 'еб твою мать', 'ёб твою мать',
         'ёбaн', 'ебaть', 'еп твою мать', 'ёп твою мать', 'ебyч', 'ебал',
         'ебало', 'ебальник', 'ебан', 'Ебануться', 'ебануться', 'ебанамать', 'ебанат', 'ебаная', 'ёбаная',
         'ебанический', 'ебанный', 'ебанныйврот', 'ебаное', 'ебануть', 'ебануться', 'ёбаную', 'ебаный', 'ебанько',
         'ебарь', 'ебат', 'ёбат', 'ебатория', 'ебать', 'ебать-копать', 'ебаться', 'ебашить', 'ебёна', 'ебет',
         'ебёт', 'ебец', 'ебик', 'ебин', 'ебись', 'ебическая', 'ебки', 'ебла', 'еблан', 'ебливый', 'еблище',
         'ебло', 'еблыст', 'ёбн', 'ебнуть', 'ебнуться', 'ебня', 'ебошить', 'ебская', 'ебский',
         'ептвоюмать', 'ебтвоюмать', 'ебун', 'ебут', 'ебуч', 'ебуче', 'ебучее', 'ебучий',
         'ебучим', 'ебущ', 'ебырь', 'елда', 'елдак', 'елдачить', 'задрачивать', 'задрота', 'зае6', 'заё6', 'заеб',
         'заёб', 'заеба', 'заебал', 'заебанец', 'заебастая', 'заебастый', 'заебать', 'заебаться', 'заебашить',
         'заебистое', 'заёбистое', 'заебистые', 'заёбистые', 'заебистый',
         'заёбистый', 'заебись', 'заебошить', 'заебываться', 'залуп', 'залупа', 'залупаться', 'залупить',
         'залупиться', 'замудохаться', 'запиздячить', 'захуячить', 'заябестая', 'злоеб', 'злоебучая',
         'злоебучее', 'злоебучий', 'ибанамат', 'ибонех', 'изговнять',
         'изъебнуться', 'ипать', 'ипаться', 'ипаццо', 'курва', 'курвятник', 'лошара',
         'лошары', 'лошок', 'лярва', 'малафья', 'мандятина', 'мандей', 'мандень', 'мандеть', 'мандища',
         'мандой', 'мандюк', 'минет', 'минетчик', 'минетчица', 'мокрощелка', 'мокрощёлка',
         'мразь', 'мудak', 'мудaк', 'мудаг', 'мудак', 'муде', 'мудель', 'мудеть', 'муди', 'мудил', 'мудила',
         'мудистый', 'мудня', 'мудоеб', 'мудозвон', 'мудоклюй', 'на хер', 'на хуй',
         'надрочить', 'наебать', 'наебет', 'наебнуть', 'наебнуться', 'наебывать', 'напиздел', 'напиздели',
         'напиздело', 'напиздили', 'настопиздить', 'нахер', 'нахуй', 'наебщик', 'наеб', 'нахуйник', 'не ебет',
         'не ебёт', 'невротебучий', 'невъебенно', 'нехира', 'Нехуй',
         'нехуйственно', 'ниибацо', 'ниипацца', 'ниипаццо', 'ниипет', 'никуя', 'нихера', 'нихуя', 'схуяли',
         'с хуяли', 'обосранец', 'обосцать', 'объебос', 'обьебать', 'обьебос',
         'однохуйственно', 'опездал', 'опизде', 'опизденивающе', 'остоебенить', 'остопиздеть',
         'отпиздить', 'отпиздячить', 'отпороть', 'отъебись', 'охуевательский', 'охуевать', 'охуевающий',
         'охуел', 'охуенно', 'охуеньчик', 'охуеть', 'охуительно', 'охуительный', 'охуяньчик',
         'охуячивать', 'охуячить', 'пездень', 'пездит', 'пездишь', 'пездо', 'пездят', 'переёбок', 'пи3д',
         'пи3де', 'пи3ду', 'пиздато', 'пиздатое',
         'пиzдец', 'пидар', 'пидарaс', 'пидорас', 'пидарасы', 'пидары', 'пидор', 'пидорасы',
         'пидорка', 'пидорок', 'пидоры', 'пидрас', 'пидр', 'пизда', 'пиздануть', 'пиздануться', 'пиздарваньчик',
         'пиздатый', 'пизденка', 'пизденыш', 'пиздёныш', 'пиздеть', 'пиздец', 'пиздит',
         'пиздить', 'пиздиться', 'пиздишь', 'пиздища', 'пезда', 'пиздище', 'пиздобол', 'пиздоболы', 'пиздобратия',
         'пиздоватый', 'пиздолиз', 'пиздонутые', 'пиздорванец', 'пиздорванка', 'пиздострадатель', 'пизду',
         'пиздуй', 'пиздун', 'пиздунья', 'пизды', 'пиздюга', 'пиздюк', 'пиздюлина', 'пиздюля', 'пиздят',
         'пиздячить', 'писюшка', 'подонки', 'подонок', 'подъебнуть', 'подъебнуться',
         'поебать', 'поебень', 'поёбываает', 'поскуда', 'потаскуха', 'потаскушка', 'похер', 'похуй',
         'похуист', 'похуистка', 'похую', 'придурок', 'приебаться',
         'припиздень', 'припизднутый', 'припиздюлина', 'пробзделся', 'проеб',
         'промандеть', 'промудеть', 'пропизделся', 'пропиздеть', 'пропиздячить',
         'разхуячить', 'разъеб', 'разъебай', 'распиздай',
         'распиздеться', 'распиздяй', 'распиздяйство', 'распроеть', 'сволота', 'сволочь',
         'сестроеб', 'спиздел', 'спиздеть', 'спиздил', 'спиздила', 'спиздили', 'спиздит', 'спиздить',
         'страхопиздище', 'сyка', 'сyкa', 'суки', 'суходрочка', 'сучара', 'сучий', 'сучка', 'сучко',
         'сучонок', 'сучье', 'сцука', 'сцуки', 'сцуконах', 'сцуль',
         'съебаться', 'трахае6', 'трахаеб', 'трахаёб', 'трахатель', 'ублюдок', 'уебать', 'уёбища', 'уебище',
         'уёбище', 'уебищное', 'уёбищное', 'уебк', 'уебки', 'уёбки', 'уебок', 'уёбок', 'усраться',
         'ушлепок', 'х_у_я_р_а', 'хyё', 'хyй', 'хyйня', 'хер', 'херня', 'херовато', 'херовина', 'херовый',
         'хитровыебанный', 'хуeм', 'хуё', 'хуевато', 'хуёвенький', 'хуевина', 'хуево',
         'хуевый', 'хуёвый', 'хуек', 'хуёк', 'хуел', 'хуем', 'хуенч', 'хуеныш', 'хуенький', 'хуеплет',
         'хуеплёт', 'хуепромышленник', 'хуерик', 'хуерыло', 'хуесос', 'хуесоска', 'хуета',
         'хуетень', 'хуею', 'хуи', 'хуйком', 'хуйло', 'хуйня', 'хуище',
         'хуякать', 'хуякнуть', 'хуяра', 'хуясе', 'хуячить', 'шалавой', 'шараёбиться',
         'шлюха', 'шлюхой', 'шлюшка', 'наябывает', 'хуевина', 'хуёвина', '6ля', '6лядь',
         'b3ъeб', 'e6aль', 'ebal', 'eblan', 'eбaл', 'eбaть',
         'Ебyч', 'Ебать', 'Ебёт', 'Еблантий', 'Fuck', 'Fucker', 'Fucking', 'Хyёв',
         'Хyя', 'Zaeb', 'Zaebal', 'Zaebali', 'Zaebat', 'ебанутый', 'АЛЛИЛПРОДИН', 'АЛЬФАМЕПРОДИН', 'АЛЬФАМЕТАДОЛ',
         'МЕТИЛТИОФЕНТАНИЛ', 'АЛЬФА-МЕТИЛФЕНТАНИЛ N', 'КАННАБИС', 'КОКАИН', 'ЛЕВОМЕТОРФАН', 'опиаты', 'метадон',
         'клофелин', 'кока', 'мефедрон', 'метилметкатинон']

d = {'а': ['а', 'a', '@'],
     'б': ['б', '6', 'b'],
     'в': ['в', 'b', 'v'],
     'г': ['г', 'r', 'g'],
     'д': ['д', 'd'],
     'е': ['е', 'e'],
     'ё': ['ё', 'e'],
     'ж': ['ж', 'zh', '*'],
     'з': ['з', '3', 'z'],
     'и': ['и', 'u', 'i'],
     'й': ['й', 'u', 'i'],
     'к': ['к', 'k', 'i{', '|{'],
     'л': ['л', 'l', 'ji'],
     'м': ['м', 'm'],
     'н': ['н', 'h', 'n'],
     'о': ['о', 'o', '0'],
     'п': ['п', 'n', 'p'],
     'р': ['р', 'r', 'p'],
     'с': ['с', 'c', 's'],
     'т': ['т', 'm', 't'],
     'у': ['у', 'y', 'u'],
     'ф': ['ф', 'f'],
     'х': ['х', 'x', 'h', '}{'],
     'ц': ['ц', 'c', 'u,'],
     'ч': ['ч', 'ch'],
     'ш': ['ш', 'sh'],
     'щ': ['щ', 'sch'],
     'ь': ['ь', 'b'],
     'ы': ['ы', 'bi'],
     'ъ': ['ъ'],
     'э': ['э', 'e'],
     'ю': ['ю', 'io'],
     'я': ['я', 'ya']
     }


def mat_validator(phrase):
    phrase = phrase.lower()

    def distance(a, b):
        """Calculates the Levenshtein distance between a and b."""
        n, m = len(a), len(b)
        if n > m:
            # Make sure n <= m, to use O(min(n, m)) space
            a, b = b, a
            n, m = m, n

        current_row = range(n + 1)  # Keep current and previous row, not entire matrix
        for i in range(1, m + 1):
            previous_row, current_row = current_row, [i] + [0] * n
            for j in range(1, n + 1):
                add, delete, change = previous_row[j] + 1, current_row[j - 1] + 1, previous_row[j - 1]
                if a[j - 1] != b[i - 1]:
                    change += 1
                current_row[j] = min(add, delete, change)

        return current_row[n]

    for key, value in d.items():
        # Проходимся по каждой букве в значении словаря. То есть по вот этим спискам ['а', 'a', '@'].
        for letter in value:
            # Проходимся по каждой букве в нашей фразе.
            for phr in phrase:
                # Если буква совпадает с буквой в нашем списке.
                if letter == phr:
                    # Заменяем эту букву на ключ словаря.
                    phrase = phrase.replace(phr, key)

    # Проходимся по всем словам.
    for word in words:
        # Разбиваем слово на части, и проходимся по ним.
        for part in range(len(phrase)):
            # Вот сам наш фрагмент.
            fragment = phrase[part: part + len(word)]
            # Если отличие этого фрагмента меньше или равно 25% этого слова, то считаем, что они равны.
            if distance(fragment, word) <= len(word) * 0.25:
                # Если они равны, выводим надпись об их нахождении.
                equal = "\nПохоже на", fragment
                return False
    return True
